Autodesk.Revit.DB.ElementType.IsValidDefaultFamilyType(Autodesk.Revit.DB.ElementId)
Identifies if this type is a valid default family type for the given family category id.
familyCategoryId:
The family category id.
Returns:
True if this type is a valid default family type for the given family category id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ElementType.Duplicate(System.String)
Duplicates an existing element type and assigns it a new name.
name:
The new name of the element type.
Returns:
The duplicated element type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The element type name was empty, contained invalid characters, or was invalid for the specific element type.
-or-
The name is already in use for this element type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InternalException:
Duplicate element type could not be obtained.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The ElementType cannot be copied.

Autodesk.Revit.DB.ElementType.IsSimilarType(Autodesk.Revit.DB.ElementId)
Checks if given type is similar to this type.
Remarks:
Two types are similar if elements that have one type could be assigned the other type.
typeId:
ElementId of the type to check.
Returns:
True if given type is similar to this type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011